{
  "topics": [
    {
      "patterns": [
        "thao tác",
        "giải thích",
        "quan sát",
        "hướng dẫn",
        "vì sao",
        "tại sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Dùng thanh trượt để thay đổi độ phóng đại (1x → 12x).",
        "Điều chỉnh ánh sáng cho ảnh rõ nét, tránh quá sáng.",
        "Quan sát dần từ tổng thể đến chi tiết (thành tế bào, nhân, không bào, lục lạp...).",
        "Nhấn 'Reset' để quay lại trạng thái ban đầu nếu mất nét."
      ],
      "explain": [
        "Mục đích: quan sát trực tiếp tế bào biểu bì vảy hành để nhận biết cấu trúc cơ bản của tế bào thực vật và rèn kỹ năng sử dụng kính hiển vi quang học.",
        "Vì sao chọn vảy hành: tế bào xếp đều, thành mỏng và trong suốt, dễ tách và dễ quan sát dưới kính.",
        "Vì sao dùng xanh methylen: tăng tương phản, làm nổi bật nhân và ranh giới tế bào để phân biệt các thành phần bên trong.",
        "Ý nghĩa học tập: củng cố khái niệm 'tế bào là đơn vị cơ bản của sự sống', phân biệt đặc điểm điển hình của tế bào thực vật (thành cellulose, không bào lớn...) so với tế bào động vật.",
        "Kết quả mong đợi: ở độ phóng đại lớn hơn, thấy rõ thành tế bào, chất tế bào, nhân; màu nhuộm làm nhân đậm hơn. Người học nắm quy trình chỉnh sáng–lấy nét–quan sát–ghi chú."
      ]
    },
    {
      "patterns": [
        "lỗi thường gặp",
        "không thấy",
        "mất nét",
        "ảnh tối",
        "ảnh sáng quá"
      ],
      "guide": [
        "Nếu ảnh quá sáng → giảm cường độ ánh sáng hoặc tăng thời gian quan sát để mắt thích nghi.",
        "Nếu ảnh tối → tăng ánh sáng từ từ, không kéo hết cỡ.",
        "Mất nét khi tăng zoom → giảm zoom một chút rồi lấy nét lại.",
        "Không thấy lục lạp → kiểm tra lại mẫu (lát cắt quá dày / thuốc nhuộm không phù hợp)."
      ],
      "explain": [
        "Khi tăng độ phóng đại, độ sâu trường giảm nên dễ mất nét; cần lấy nét lại mỗi khi đổi zoom.",
        "Tương phản tối ưu giúp ranh giới bào quan rõ hơn; ánh sáng quá mạnh làm 'cháy' chi tiết.",
        "Khả năng nhìn thấy lục lạp phụ thuộc loài thực vật, tình trạng mẫu và chuẩn bị tiêu bản."
      ]
    },
    {
      "patterns": ["an toàn", "quy trình", "reset", "làm sạch"],
      "guide": [
        "Thực hiện theo thứ tự: thiết lập zoom → chỉnh sáng → quan sát → ghi chú.",
        "Sau mỗi lần thử, dùng 'Reset' để về cấu hình ban đầu trước khi thay đổi thông số mới.",
        "Dọn sạch vùng làm việc (xóa ghi chú tạm) trước khi chuyển sang thí nghiệm khác."
      ],
      "explain": [
        "Giữ quy trình nhất quán giúp so sánh kết quả chính xác giữa các lần quan sát.",
        "Reset ngăn tích lũy sai lệch từ các thiết lập trước, giúp dữ liệu nhất quán hơn."
      ]
    }
  ]
}
