{
  "topics": [
    {
      "id": "ops_controls",
      "title": "Thao tác điều khiển",
      "patterns": [
        "thao tác",
        "hướng dẫn",
        "cách làm",
        "điều khiển",
        "bắt đầu",
        "tạm dừng",
        "đặt lại",
        "ngẫu nhiên",
        "kéo thả"
      ],
      "guide": [
        "Bấm 'Bắt đầu' để chạy mô phỏng; 'Tạm dừng' để dừng lại; 'Đặt lại' để trở về góc ban đầu.",
        "Bấm 'Ngẫu nhiên' để tạo góc ban đầu ngẫu nhiên.",
        "Kéo trực tiếp 'quả nặng' để thay đổi góc ban đầu (mô phỏng sẽ tạm dừng khi đang kéo).",
        "Dùng các thanh trượt để thay đổi các thông số: 'L' (m), 'g' (m/s²), 'b' (giảm chấn), 'm' (kg), 'θ₀' (độ).",
        "Bật/tắt 'Vệt quỹ đạo' để theo dõi đường đi, và 'Đồ thị năng lượng' để xem sự biến thiên năng lượng."
      ],
      "explain": [
        "Mục đích: giúp học sinh hiểu cách điều chỉnh và quan sát chuyển động dao động thực tế của con lắc đơn thông qua các tham số vật lý.",
        "Vì sao cần mô phỏng: cho phép thao tác linh hoạt và quan sát nhanh ảnh hưởng của từng đại lượng mà thí nghiệm thật khó thực hiện chính xác.",
        "Ý nghĩa học tập: rèn kỹ năng điều chỉnh tham số, đọc đồ thị, phân tích quỹ đạo, từ đó hiểu bản chất chuyển động dao động.",
        "Kết quả mong đợi: người học nhận biết được mối liên hệ giữa chiều dài dây, khối lượng, lực cản và dạng dao động."
      ]
    },
    {
      "id": "theory_equation",
      "title": "Phương trình chuyển động & mô hình",
      "patterns": [
        "giải thích",
        "phương trình",
        "mô hình",
        "vi sai",
        "rk4",
        "rk 4",
        "runge kutta",
        "tại sao",
        "ý nghĩa"
      ],
      "guide": [
        "Mô phỏng sử dụng phương pháp Runge–Kutta bậc 4 (RK4) để giải phương trình dao động của con lắc có giảm chấn.",
        "Phương trình chuyển động tổng quát: d²θ/dt² + (b/m)·dθ/dt + (g/L)·sinθ = 0."
      ],
      "explain": [
        "Mục đích: minh họa cách mô hình toán học mô tả chính xác chuyển động dao động thực tế của con lắc.",
        "Vì sao cần sử dụng RK4: giúp tính toán ổn định và chính xác ngay cả khi góc dao động lớn, tránh sai số tích lũy.",
        "Ý nghĩa học tập: giúp người học hiểu mối liên hệ giữa phương trình vi phân và chuyển động vật lý, từ đó củng cố kỹ năng đọc – hiểu mô hình.",
        "Kết quả mong đợi: người học thấy rõ sự tương ứng giữa công thức và chuyển động trực quan trên màn hình."
      ]
    },
    {
      "id": "theory_energy",
      "title": "Năng lượng cơ học",
      "patterns": [
        "năng lượng",
        "đồ thị",
        "cơ năng",
        "thế năng",
        "động năng",
        "energy",
        "ke",
        "pe",
        "tổng năng lượng"
      ],
      "guide": [
        "Đồ thị năng lượng hiển thị động năng, thế năng và tổng năng lượng theo thời gian.",
        "Có thể bật/tắt mục 'Hiện đồ thị năng lượng' để quan sát rõ sự thay đổi."
      ],
      "explain": [
        "Mục đích: minh họa định luật bảo toàn năng lượng cơ học và tác dụng của lực cản lên hệ dao động.",
        "Vì sao cần quan sát đồ thị năng lượng: giúp dễ dàng theo dõi sự chuyển hóa giữa động năng và thế năng trong từng pha dao động.",
        "Ý nghĩa học tập: giúp học sinh hiểu rằng tổng năng lượng chỉ bảo toàn khi không có ma sát, đồng thời nhận diện rõ sự hao hụt năng lượng do giảm chấn.",
        "Kết quả mong đợi: người học thấy được dạng đồ thị đặc trưng – tổng năng lượng giảm dần theo thời gian khi có ma sát."
      ]
    },
    {
      "id": "period_small_large",
      "title": "Chu kì: góc nhỏ & góc lớn",
      "patterns": [
        "chu kì",
        "chu kỳ",
        "period",
        "T",
        "bao lâu",
        "tần số",
        "góc nhỏ",
        "góc lớn"
      ],
      "guide": [
        "Với góc nhỏ (|θ| ≤ 10–15°) và không có giảm chấn, chu kì xấp xỉ T ≈ 2π√(L/g).",
        "Khi góc lớn, chu kì thực tế tăng lên so với giá trị lý thuyết do ảnh hưởng phi tuyến của sinθ."
      ],
      "explain": [
        "Mục đích: giúp học sinh phân biệt giới hạn áp dụng của công thức xấp xỉ góc nhỏ trong con lắc đơn.",
        "Vì sao cần khảo sát góc lớn: cho thấy ảnh hưởng phi tuyến của chuyển động thật so với mô hình lý tưởng.",
        "Ý nghĩa học tập: củng cố tư duy phân tích sai số và hiểu rõ sự khác biệt giữa lý thuyết – thực nghiệm.",
        "Kết quả mong đợi: học sinh nhận ra rằng khi góc tăng, chu kì dao động dài hơn dự đoán lý thuyết."
      ]
    },
    {
      "id": "damping_mass",
      "title": "Ảnh hưởng của giảm chấn b và khối lượng m",
      "patterns": [
        "giảm chấn",
        "ma sát",
        "b",
        "khối lượng",
        "mass",
        "m",
        "hao hụt"
      ],
      "guide": [
        "Tăng 'b' khiến dao động tắt dần nhanh hơn, năng lượng giảm nhanh hơn.",
        "Thay đổi 'm' ảnh hưởng đến tốc độ tắt dần vì tỷ số b/m quyết định mức giảm chấn."
      ],
      "explain": [
        "Mục đích: cho thấy tác động của lực cản và khối lượng lên tốc độ suy giảm dao động.",
        "Vì sao cần khảo sát: trong thực tế không có dao động nào hoàn toàn không ma sát, nên việc thêm giảm chấn phản ánh đúng hệ thật.",
        "Ý nghĩa học tập: giúp người học hiểu hiện tượng dao động tắt dần và sự phân rã năng lượng theo thời gian.",
        "Kết quả mong đợi: quan sát được biên độ giảm dần đều, chứng minh vai trò của ma sát và khối lượng."
      ]
    },
    {
      "id": "units_ranges",
      "title": "Đơn vị & khoảng giá trị",
      "patterns": ["đơn vị", "unit", "phạm vi", "range", "giới hạn", "min max"],
      "guide": [
        "Phạm vi giá trị: L (0.2–2.5 m), g (0.1–20 m/s²), b (0–1), m (0.1–5 kg), θ₀ (−170° đến 170°).",
        "Góc hiển thị trên panel là radian, trong khi thanh trượt dùng độ."
      ],
      "explain": [
        "Mục đích: đảm bảo mô phỏng hoạt động trong giới hạn vật lí thực tế và ổn định về mặt tính toán.",
        "Vì sao giới hạn này cần thiết: nếu giá trị vượt ngưỡng, kết quả sẽ phi thực tế hoặc dao động không ổn định.",
        "Ý nghĩa học tập: hướng dẫn người học chọn thông số hợp lý để kết quả phản ánh đúng hiện tượng vật lí.",
        "Kết quả mong đợi: mô phỏng hiển thị dao động mượt, đúng quy luật khi thông số trong phạm vi cho phép."
      ]
    },
    {
      "id": "troubleshoot_physics",
      "title": "Lỗi thường gặp (Con Lắc Đơn)",
      "patterns": [
        "lỗi thường gặp",
        "không chạy",
        "không thấy đồ thị",
        "treo",
        "khung trống",
        "đồ thị năng lượng"
      ],
      "guide": [
        "Không thấy đồ thị năng lượng: bật 'Hiện đồ thị năng lượng' hoặc mở rộng khung hiển thị.",
        "Nếu mô phỏng dừng sau khi kéo: bấm 'Bắt đầu' để tiếp tục.",
        "Nếu chạy chậm: tắt 'Vệt quỹ đạo' hoặc giảm số khung hiển thị để mượt hơn."
      ],
      "explain": [
        "Mục đích: giúp người học dễ dàng nhận biết và khắc phục các lỗi thao tác cơ bản khi sử dụng mô phỏng.",
        "Vì sao cần mục này: nhằm đảm bảo quá trình học tập không bị gián đoạn bởi lỗi kỹ thuật hoặc hiển thị.",
        "Ý nghĩa học tập: khuyến khích khả năng tự xử lý tình huống và duy trì sự tập trung vào nội dung vật lí.",
        "Kết quả mong đợi: người học chủ động làm chủ mô phỏng và tối ưu trải nghiệm học tập của mình."
      ]
    }
  ]
}
