{
  "topics": [
    {
      "id": "ops_controls",
      "title": "Thao tác & điều khiển",
      "patterns": [
        "thao tác",
        "cách làm",
        "hướng dẫn",
        "điều khiển",
        "rót",
        "đun",
        "nút",
        "reset",
        "ống a",
        "ống b",
        "ống c"
      ],
      "guide": [
        "Bấm “Rót A → C” để chuyển Cu(OH)₂ từ ống A sang ống C theo từng bước nhỏ (~1.5 s).",
        "Bấm “Rót B → C” để chuyển Glucose từ ống B sang ống C.",
        "Bấm “Đun C” để mô phỏng gia nhiệt ống C: màu dung dịch chuyển dần từ xanh lam sang đỏ gạch, đồng thời xuất hiện hạt kết tủa.",
        "Bấm “Đặt lại” để khôi phục các thể tích ban đầu: A=20 mL, B=15 mL, C=0 mL."
      ],
      "explain": [
        "Tại sao có thí nghiệm này: để người học 'rèn kỹ năng thao tác mô phỏng phản ứng hóa học tuần tự', giống quá trình thực hành thật trong phòng thí nghiệm.",
        "Thí nghiệm dùng để làm gì: giúp 'quan sát rõ các giai đoạn của phản ứng khử Cu²⁺ bằng glucose', qua đó hiểu mối liên hệ giữa điều kiện thao tác và kết quả màu sắc."
      ]
    },
    {
      "id": "logic_outcomes",
      "title": "Kết quả mong đợi theo từng bước",
      "patterns": [
        "kết quả",
        "màu gì",
        "hiện tượng",
        "đổi màu",
        "kết tủa",
        "đun lên thì sao"
      ],
      "guide": [
        "Chỉ rót A (Cu(OH)₂) vào C: dung dịch trong C có màu xanh lam.",
        "Chỉ rót B (Glucose) vào C: dung dịch gần như không màu, không đổi màu đáng kể.",
        "Rót A rồi B (hoặc ngược lại) vào C nhưng CHƯA đun: hỗn hợp có Cu²⁺ và glucose → vẫn chủ yếu xanh lam; phản ứng khử chưa rõ.",
        "Đun C khi trong ống có cả Cu²⁺ và glucose: màu chuyển dần xanh → đỏ nâu/đỏ gạch, xuất hiện hạt lắng Cu₂O."
      ],
      "explain": [
        "Tại sao có phần này: để học sinh 'dễ theo dõi tiến trình phản ứng và liên hệ giữa thao tác – hiện tượng'.",
        "Thí nghiệm dùng để làm gì: giúp 'nhận diện glucose là chất khử', thể hiện qua sự hình thành kết tủa đỏ gạch đặc trưng."
      ]
    },
    {
      "id": "chem_equation",
      "title": "Phương trình phản ứng (tóm tắt)",
      "patterns": [
        "phương trình",
        "phản ứng",
        "cu2o",
        "oxi hóa",
        "khử",
        "fehling",
        "benedict"
      ],
      "guide": [
        "Phương trình tổng quát trong mô phỏng:",
        "C₆H₁₂O₆ + 2Cu(OH)₂ → C₆H₁₂O₇ + Cu₂O↓ + 2H₂O"
      ],
      "explain": [
        "Tại sao có thí nghiệm này: để 'minh họa tính khử của nhóm –CHO trong glucose', giúp người học liên hệ giữa công thức hóa học và hiện tượng quan sát.",
        "Thí nghiệm dùng để làm gì: giúp 'củng cố khái niệm oxi hóa – khử trong hóa học hữu cơ', thông qua phản ứng đặc trưng tương tự thử Fehling hoặc Benedict."
      ]
    },
    {
      "id": "requirements",
      "title": "Điều kiện cần để thấy kết tủa Cu₂O",
      "patterns": [
        "điều kiện",
        "khi nào có kết tủa",
        "vì sao không có kết tủa",
        "tại sao không đổi màu"
      ],
      "guide": [
        "Ống C phải chứa Cu²⁺ (đã rót A).",
        "Ống C phải chứa glucose (đã rót B).",
        "Cần GIA NHIỆT (bấm “Đun C”) để phản ứng khử xảy ra nhanh và rõ."
      ],
      "explain": [
        "Tại sao có phần này: vì phản ứng chỉ xảy ra khi đủ 'các điều kiện về chất và năng lượng' (có Cu²⁺, có chất khử và được đun nóng).",
        "Phần này dùng để làm gì: giúp người học hiểu rằng 'thiếu một yếu tố sẽ không tạo kết tủa đỏ gạch', từ đó thấy rõ mối quan hệ giữa điều kiện phản ứng và sản phẩm."
      ]
    },
    {
      "id": "volumes_table",
      "title": "Theo dõi thể tích",
      "patterns": ["thể tích", "bao nhiêu ml", "bảng", "còn lại"],
      "guide": [
        "Bảng dưới mô tả thể tích còn lại ở ống A, B và tổng thể tích hiện có trong ống C.",
        "Mỗi lần rót, mô phỏng chia nhỏ dòng chảy để bạn thấy mức chất lỏng tăng dần."
      ],
      "explain": [
        "Tại sao có phần này: để 'giúp học sinh hình dung trực quan quá trình rót và pha trộn hóa chất'.",
        "Phần này dùng để làm gì: nhằm 'rèn kỹ năng định lượng và theo dõi biến đổi thể tích', như khi thực hành thật trong phòng thí nghiệm."
      ]
    },
    {
      "id": "troubleshoot",
      "title": "Xử lý lỗi thường gặp",
      "patterns": [
        "lỗi",
        "không đổi màu",
        "không có kết tủa",
        "không chạy",
        "reset",
        "sửa lỗi"
      ],
      "guide": [
        "Không thấy đỏ gạch sau khi đun? → Hãy đảm bảo đã rót cả A (Cu²⁺) và B (glucose) vào ống C.",
        "Đang đun mà rót thêm A/B: mô phỏng sẽ reset và hủy kết tủa — hãy bắt đầu lại.",
        "Nếu hiện tượng bất thường, bấm “Đặt lại” rồi thao tác lại theo thứ tự: Rót A → Rót B → Đun C."
      ],
      "explain": [
        "Tại sao có phần này: để 'người học tự kiểm tra và khắc phục lỗi thao tác', không cần hướng dẫn viên trực tiếp.",
        "Phần này dùng để làm gì: giúp đảm bảo quá trình học 'liên tục, chính xác và đúng quy trình thí nghiệm'."
      ]
    },
    {
      "id": "safety_note",
      "title": "Lưu ý an toàn (kiến thức mở rộng)",
      "patterns": [
        "an toàn",
        "cẩn trọng",
        "thực nghiệm thật",
        "phòng thí nghiệm"
      ],
      "guide": [
        "Trong thí nghiệm thật, Cu(OH)₂ và muối Cu²⁺ có thể gây kích ứng; cần đeo găng tay và kính bảo hộ.",
        "Khi gia nhiệt ống nghiệm, phải dùng kẹp và hướng miệng ống tránh người xung quanh."
      ],
      "explain": [
        "Tại sao có phần này: để 'liên hệ giữa mô phỏng và thực tế phòng thí nghiệm', nhấn mạnh vai trò của an toàn trong học tập STEM.",
        "Phần này dùng để làm gì: giúp người học 'ý thức về quy tắc an toàn khi làm việc với hóa chất và nhiệt', chuẩn bị tốt cho thực hành thật."
      ]
    }
  ]
}
