{
  "topics": [
    {
      "patterns": [
        "thao tác",
        "cách làm",
        "hướng dẫn",
        "điều khiển",
        "rót",
        "đun",
        "nút",
        "reset",
        "ống a",
        "ống b",
        "ống c",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Bấm “Rót A → C” để chuyển Cu(OH)₂ từ ống A sang ống C theo từng bước nhỏ (~1.5 s).",
        "Bấm “Rót B → C” để chuyển Glucose từ ống B sang ống C.",
        "Bấm “Đun C” để mô phỏng gia nhiệt ống C: màu dung dịch chuyển dần từ xanh lam sang đỏ gạch, đồng thời xuất hiện hạt kết tủa.",
        "Bấm “Đặt lại” để khôi phục các thể tích ban đầu: A=20 mL, B=15 mL, C=0 mL."
      ],
      "explain": [
        "Mục đích: rèn kỹ năng thao tác và quan sát phản ứng hóa học tuần tự, mô phỏng lại quy trình thực hành thật trong phòng thí nghiệm.",
        "Vì sao cần mô phỏng: giúp người học quan sát rõ mối liên hệ giữa thao tác, hiện tượng và kết quả, đặc biệt khi đun nóng và xuất hiện kết tủa.",
        "Ý nghĩa học tập: giúp học sinh hiểu bản chất phản ứng khử Cu²⁺ bằng glucose và vai trò của nhiệt trong phản ứng.",
        "Kết quả mong đợi: người học nhận biết rõ từng giai đoạn từ dung dịch xanh lam đến kết tủa đỏ gạch."
      ]
    },
    {
      "patterns": [
        "kết quả",
        "màu gì",
        "hiện tượng",
        "đổi màu",
        "kết tủa",
        "đun lên thì sao",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Chỉ rót A (Cu(OH)₂) vào C → dung dịch có màu xanh lam.",
        "Chỉ rót B (Glucose) vào C → dung dịch gần như không màu, không đổi màu đáng kể.",
        "Rót A rồi B (hoặc ngược lại) nhưng chưa đun → hỗn hợp chứa Cu²⁺ và glucose, vẫn xanh lam.",
        "Đun C khi có cả Cu²⁺ và glucose → màu chuyển từ xanh lam sang đỏ nâu, xuất hiện kết tủa Cu₂O."
      ],
      "explain": [
        "Mục đích: giúp người học theo dõi trực quan sự thay đổi màu sắc qua từng bước của phản ứng.",
        "Vì sao dung dịch đổi màu: glucose khử ion Cu²⁺ thành Cu₂O khi được gia nhiệt, tạo màu đỏ gạch đặc trưng.",
        "Ý nghĩa học tập: giúp xác định vai trò của glucose như một chất khử, đồng thời củng cố khái niệm phản ứng oxi hóa – khử.",
        "Kết quả mong đợi: sau khi đun, ống C xuất hiện kết tủa đỏ gạch minh chứng cho sự khử Cu²⁺."
      ]
    },
    {
      "patterns": [
        "phương trình",
        "phản ứng",
        "cu2o",
        "oxi hóa",
        "khử",
        "fehling",
        "benedict",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Phương trình tổng quát trong mô phỏng:",
        "C₆H₁₂O₆ + 2Cu(OH)₂ → C₆H₁₂O₇ + Cu₂O↓ + 2H₂O"
      ],
      "explain": [
        "Mục đích: minh họa bản chất hóa học của phản ứng khử Cu²⁺ bởi glucose – phản ứng đặc trưng của đường khử.",
        "Vì sao cần phần này: giúp người học kết nối hiện tượng đổi màu với phương trình phản ứng cụ thể.",
        "Ý nghĩa học tập: củng cố khái niệm oxi hóa – khử trong hóa hữu cơ và so sánh với các phản ứng Fehling hoặc Benedict thực tế.",
        "Kết quả mong đợi: học sinh hiểu rõ rằng Cu₂O đỏ gạch là sản phẩm khử của Cu²⁺ trong phản ứng với glucose."
      ]
    },
    {
      "patterns": [
        "điều kiện",
        "khi nào có kết tủa",
        "vì sao không có kết tủa",
        "tại sao không đổi màu",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Ống C phải chứa Cu²⁺ (đã rót A).",
        "Ống C phải chứa glucose (đã rót B).",
        "Cần gia nhiệt (bấm “Đun C”) để phản ứng khử diễn ra rõ rệt."
      ],
      "explain": [
        "Mục đích: nhấn mạnh các điều kiện cần để phản ứng tạo Cu₂O có thể xảy ra.",
        "Vì sao cần đủ điều kiện: phản ứng khử Cu²⁺ chỉ xảy ra khi có chất khử (glucose) và nhiệt độ đủ cao để kích hoạt quá trình.",
        "Ý nghĩa học tập: giúp người học hiểu rằng mỗi phản ứng hóa học phụ thuộc vào cả thành phần và năng lượng cung cấp.",
        "Kết quả mong đợi: khi hội đủ các yếu tố, dung dịch chuyển sang màu đỏ gạch đặc trưng của Cu₂O."
      ]
    },
    {
      "patterns": [
        "thể tích",
        "bao nhiêu ml",
        "bảng",
        "còn lại",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Bảng dưới mô tả thể tích còn lại ở ống A, B và tổng thể tích trong ống C.",
        "Mỗi lần rót, mô phỏng chia nhỏ dòng chảy để người học quan sát mức chất lỏng dâng dần."
      ],
      "explain": [
        "Mục đích: giúp người học theo dõi sự thay đổi thể tích và nhận thức mối liên hệ giữa lượng chất và hiện tượng xảy ra.",
        "Vì sao cần phần này: để phản ánh đúng thao tác định lượng trong thí nghiệm thực tế.",
        "Ý nghĩa học tập: rèn kỹ năng đọc và so sánh dữ liệu định lượng khi thực hành thí nghiệm hóa học.",
        "Kết quả mong đợi: học sinh hiểu rằng thể tích chất ảnh hưởng đến mức độ và tốc độ phản ứng."
      ]
    },
    {
      "patterns": [
        "lỗi",
        "không đổi màu",
        "không có kết tủa",
        "không chạy",
        "reset",
        "sửa lỗi",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Không thấy đỏ gạch sau khi đun? → Hãy đảm bảo đã rót cả A (Cu²⁺) và B (glucose) vào ống C.",
        "Nếu đang đun mà rót thêm A/B, mô phỏng sẽ tự đặt lại – cần thao tác lại theo đúng thứ tự.",
        "Nếu hiện tượng bất thường, bấm “Đặt lại” rồi thực hiện lại theo: Rót A → Rót B → Đun C."
      ],
      "explain": [
        "Mục đích: giúp người học phát hiện và khắc phục lỗi thao tác phổ biến khi tiến hành mô phỏng.",
        "Vì sao cần phần này: đảm bảo người học nắm được quy trình chuẩn và hiểu nguyên nhân khiến phản ứng không xảy ra.",
        "Ý nghĩa học tập: tăng tính tự chủ, giúp người học rèn khả năng kiểm tra và điều chỉnh thao tác.",
        "Kết quả mong đợi: học sinh thao tác đúng thứ tự và thu được hiện tượng chuẩn – kết tủa Cu₂O đỏ gạch sau khi đun."
      ]
    },
    {
      "patterns": [
        "an toàn",
        "cẩn trọng",
        "thực nghiệm thật",
        "phòng thí nghiệm",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Trong thí nghiệm thật, Cu(OH)₂ và muối Cu²⁺ có thể gây kích ứng; cần đeo găng tay và kính bảo hộ.",
        "Khi gia nhiệt ống nghiệm, phải dùng kẹp và hướng miệng ống tránh người xung quanh."
      ],
      "explain": [
        "Mục đích: giúp người học nhận thức tầm quan trọng của an toàn trong khi làm việc với hóa chất và nhiệt.",
        "Vì sao cần chú ý: các hợp chất chứa Cu²⁺ có thể độc hại nếu tiếp xúc trực tiếp, và việc đun nóng dễ gây nguy hiểm nếu thao tác sai.",
        "Ý nghĩa học tập: giúp học sinh hình thành thói quen làm việc an toàn trong phòng thí nghiệm.",
        "Kết quả mong đợi: người học hiểu và tuân thủ quy tắc bảo hộ, sẵn sàng thực hành thật một cách an toàn và hiệu quả."
      ]
    }
  ]
}
