{
  "topics": [
    {
      "patterns": [
        "thao tác",
        "cách làm",
        "hướng dẫn",
        "điều khiển",
        "rót",
        "đun",
        "nút",
        "reset",
        "ống a",
        "ống b",
        "ống c",
        "ống d",
        "hỗn hợp",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Bấm “Rót CuSO₄ → D” để chuyển dung dịch CuSO₄ từ ống A sang ống D theo từng bước nhỏ (~1.5 s).",
        "Bấm “Rót NaOH → D” để chuyển dung dịch NaOH từ ống B sang ống D, tạo môi trường kiềm cho Cu²⁺.",
        "Bấm “Rót Glucose → D” để chuyển dung dịch Glucose từ ống C sang ống D.",
        "Khi trong ống D đã có CuSO₄ và NaOH, mô phỏng coi như đã tạo được kết tủa Cu(OH)₂ (xanh đậm) trong ống D.",
        "Bấm “Đun ống D” để mô phỏng gia nhiệt ống D: Cu(OH)₂ dần chuyển thành Cu₂O đỏ gạch nếu có mặt Glucose.",
        "Bấm “Đặt lại” để khôi phục các thể tích ban đầu: A = 20 mL (CuSO₄), B = 20 mL (NaOH), C = 10 mL (Glucose), D = 0 mL."
      ],
      "explain": [
        "Mục đích: rèn kỹ năng thao tác và quan sát phản ứng hóa học theo đúng trình tự: điều chế Cu(OH)₂ từ CuSO₄/NaOH rồi cho phản ứng với Glucose.",
        "Vì sao cần mô phỏng: giúp người học quan sát rõ mối liên hệ giữa thao tác (rót A, B, C; đun D), hiện tượng (kết tủa xanh, đỏ gạch) và bản chất phản ứng.",
        "Ý nghĩa học tập: giúp học sinh hiểu được vai trò từng thuốc thử (CuSO₄, NaOH, Glucose) và bước gia nhiệt trong phản ứng oxi hóa – khử.",
        "Kết quả mong đợi: người học nhận biết rõ các giai đoạn: dung dịch CuSO₄ xanh nhạt → Cu(OH)₂ kết tủa xanh đậm → Cu₂O đỏ gạch khi đun với Glucose."
      ]
    },
    {
      "patterns": [
        "kết quả",
        "màu gì",
        "hiện tượng",
        "đổi màu",
        "kết tủa",
        "đun lên thì sao",
        "ống d",
        "hỗn hợp",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Chỉ rót CuSO₄ (A) vào ống D → dung dịch trong ống D có màu xanh nhạt (Cu²⁺ trong môi trường nước).",
        "Chỉ rót NaOH (B) vào ống D → dung dịch kiềm không màu, không có sự đổi màu đáng kể.",
        "Rót CuSO₄ và NaOH vào ống D (đủ cả A và B) → trong ống D xuất hiện kết tủa Cu(OH)₂ màu xanh đậm.",
        "Chỉ rót Glucose (C) vào ống D → dung dịch gần như không màu, không có hiện tượng đặc biệt.",
        "Đã có Cu(OH)₂ trong ống D, nhưng chưa rót Glucose → khi chưa đun, hệ vẫn chỉ là kết tủa xanh Cu(OH)₂, chưa có Cu₂O đỏ gạch.",
        "Khi trong ống D có cả Cu(OH)₂ và Glucose, bấm “Đun ống D” → màu chuyển dần từ xanh đậm sang đỏ nâu, xuất hiện kết tủa Cu₂O đỏ gạch."
      ],
      "explain": [
        "Mục đích: giúp người học theo dõi trực quan sự thay đổi màu sắc và trạng thái của hệ khi lần lượt thêm CuSO₄, NaOH, Glucose và khi đun nóng.",
        "Vì sao dung dịch đổi màu: Glucose khử ion Cu²⁺ (trong Cu(OH)₂) thành Cu₂O khi được gia nhiệt, tạo màu đỏ gạch đặc trưng ở đáy ống nghiệm.",
        "Ý nghĩa học tập: giúp xác định vai trò của Glucose như một chất khử, phân biệt rõ pha hình thành Cu(OH)₂ (xanh đậm) và pha tạo Cu₂O (đỏ gạch).",
        "Kết quả mong đợi: sau khi đun ống D có đủ Cu(OH)₂ và Glucose, học sinh quan sát được kết tủa Cu₂O đỏ gạch và hiểu mối liên hệ với phản ứng oxi hóa – khử."
      ]
    },
    {
      "patterns": [
        "phương trình",
        "phản ứng",
        "cu2o",
        "oxi hóa",
        "khử",
        "fehling",
        "benedict",
        "cuoh2",
        "cuso4",
        "naoh",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Bước 1 – điều chế Cu(OH)₂ trong ống D:",
        "CuSO₄ + 2NaOH → Cu(OH)₂↓ + Na₂SO₄",
        "Bước 2 – Glucose khử Cu(OH)₂ khi đun nóng:",
        "C₆H₁₂O₆ + 2Cu(OH)₂ → C₆H₁₂O₇ + Cu₂O↓ + 2H₂O"
      ],
      "explain": [
        "Mục đích: minh họa trọn vẹn hai giai đoạn của thí nghiệm – từ việc điều chế Cu(OH)₂ bằng CuSO₄/NaOH cho đến phản ứng khử Cu²⁺ bởi Glucose.",
        "Vì sao cần phần này: giúp người học gắn kết hiện tượng (kết tủa xanh, đỏ gạch) với các phương trình phản ứng cụ thể chứ không chỉ nhìn màu sắc.",
        "Ý nghĩa học tập: củng cố khái niệm oxi hóa – khử trong hóa học hữu cơ, đồng thời liên hệ tới các phản ứng nhận biết đường khử như Fehling hoặc Benedict.",
        "Kết quả mong đợi: học sinh hiểu rằng Cu₂O đỏ gạch là sản phẩm khử của Cu²⁺ sau khi Cu(OH)₂ tham gia phản ứng với Glucose trong điều kiện đun nóng."
      ]
    },
    {
      "patterns": [
        "điều kiện",
        "khi nào có kết tủa",
        "vì sao không có kết tủa",
        "tại sao không đổi màu",
        "không đỏ gạch",
        "không xuất hiện cu2o",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Ống D phải nhận CuSO₄ từ ống A để có ion Cu²⁺.",
        "Ống D phải nhận NaOH từ ống B để tạo kết tủa Cu(OH)₂ màu xanh đậm.",
        "Ống D phải nhận thêm Glucose từ ống C để có chất khử.",
        "Cần gia nhiệt (bấm “Đun ống D”) để phản ứng khử diễn ra rõ rệt, tạo kết tủa Cu₂O đỏ gạch."
      ],
      "explain": [
        "Mục đích: nhấn mạnh những điều kiện bắt buộc để phản ứng tạo Cu₂O có thể xảy ra trong mô phỏng.",
        "Vì sao cần đủ điều kiện: nếu thiếu một trong ba yếu tố (Cu²⁺, môi trường kiềm tạo Cu(OH)₂, Glucose) hoặc thiếu nhiệt, phản ứng khử không xảy ra hoặc không rõ rệt.",
        "Ý nghĩa học tập: giúp người học hiểu rằng mỗi phản ứng phụ thuộc vào cả thành phần hóa chất lẫn năng lượng cung cấp (ở đây là gia nhiệt).",
        "Kết quả mong đợi: khi hội đủ CuSO₄ + NaOH + Glucose và được đun nóng, ống D xuất hiện kết tủa Cu₂O đỏ gạch đúng như lý thuyết."
      ]
    },
    {
      "patterns": [
        "thể tích",
        "bao nhiêu ml",
        "bảng",
        "còn lại",
        "ống d chứa bao nhiêu",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Bảng dưới mô tả thể tích còn lại ở ống A (CuSO₄), B (NaOH), C (Glucose) và tổng thể tích hỗn hợp trong ống D.",
        "Mỗi lần rót, mô phỏng chia nhỏ dòng chảy theo nhiều bước để người học quan sát mức chất lỏng dâng dần trong từng ống.",
        "Thể tích ban đầu: A = 20 mL (CuSO₄), B = 20 mL (NaOH), C = 10 mL (Glucose), D = 0 mL.",
        "Tổng thể tích tối đa trong ống D được giới hạn để chiều cao cột chất lỏng nhìn trực quan và không bị tràn so với hình ống nghiệm."
      ],
      "explain": [
        "Mục đích: giúp người học theo dõi sự thay đổi thể tích giữa các ống và nhận ra mối liên hệ giữa lượng chất và mức độ hiện tượng xảy ra.",
        "Vì sao cần phần này: phản ánh gần đúng thao tác định lượng trong thí nghiệm thật (rót hết hay rót một phần dung dịch vào ống phản ứng).",
        "Ý nghĩa học tập: rèn kỹ năng đọc, so sánh dữ liệu định lượng và liên hệ với màu sắc/kết tủa thu được khi thực hành thí nghiệm hóa học.",
        "Kết quả mong đợi: học sinh hiểu rằng thể tích và nồng độ các dung dịch (CuSO₄, NaOH, Glucose) ảnh hưởng đến lượng Cu(OH)₂ và Cu₂O tạo thành."
      ]
    },
    {
      "patterns": [
        "lỗi",
        "không đổi màu",
        "không có kết tủa",
        "không chạy",
        "reset",
        "sửa lỗi",
        "không đỏ gạch",
        "không tạo cuoh2",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Không thấy kết tủa xanh Cu(OH)₂ trong ống D? → Hãy đảm bảo đã rót cả CuSO₄ (A) và NaOH (B) vào ống D.",
        "Không thấy đỏ gạch sau khi đun? → Kiểm tra xem trong ống D đã có cả Cu(OH)₂ (từ A + B) và Glucose (C) chưa, sau đó mới bấm “Đun ống D”.",
        "Nếu đang đun mà tiếp tục rót thêm A/B/C, mô phỏng sẽ hủy quá trình đun hiện tại và trạng thái kết tủa sẽ được đặt lại – cần thao tác lại theo đúng thứ tự.",
        "Nếu hiện tượng bất thường hoặc khó quan sát, bấm “Đặt lại” rồi thực hiện lại theo: Rót CuSO₄ → Rót NaOH → (quan sát Cu(OH)₂) → Rót Glucose → Đun ống D."
      ],
      "explain": [
        "Mục đích: giúp người học nhận ra và khắc phục các lỗi thao tác phổ biến khi làm mô phỏng (thiếu thuốc thử, sai thứ tự rót, quên đun…).",
        "Vì sao cần phần này: đảm bảo người học nắm được quy trình chuẩn để phản ứng xảy ra đúng như lý thuyết và quan sát được hiện tượng chuẩn.",
        "Ý nghĩa học tập: tăng tính tự chủ, giúp học sinh biết tự kiểm tra điều kiện phản ứng và sửa sai thao tác trước khi kết luận ‘thí nghiệm không thành công’.",
        "Kết quả mong đợi: học sinh thao tác đúng thứ tự với đủ thuốc thử, đun đúng lúc và thu được kết tủa Cu₂O đỏ gạch trong ống D như mong đợi."
      ]
    },
    {
      "patterns": [
        "an toàn",
        "cẩn trọng",
        "thực nghiệm thật",
        "phòng thí nghiệm",
        "cuso4",
        "naoh",
        "hóa chất độc",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Trong thí nghiệm thật, các muối Cu²⁺ (như CuSO₄) có thể gây kích ứng da và độc nếu nuốt phải; cần đeo găng tay, không để dính lên tay và không nếm thử.",
        "Dung dịch NaOH là chất ăn mòn mạnh; khi làm thí nghiệm thật phải đeo găng, kính bảo hộ và tránh để bắn vào da, mắt hoặc quần áo.",
        "Khi gia nhiệt ống nghiệm ngoài đời thật, phải dùng kẹp ống nghiệm và luôn hướng miệng ống tránh phía người thao tác và người xung quanh.",
        "Không được hơ ống nghiệm liên tục tại một điểm trên ngọn lửa; cần đưa qua lại nhẹ nhàng để tránh nứt vỡ ống nghiệm."
      ],
      "explain": [
        "Mục đích: giúp người học ý thức rằng dù đang làm việc trong môi trường mô phỏng an toàn, nhưng khi ra phòng thí nghiệm thật thì CuSO₄, NaOH và sản phẩm phản ứng đều có nguy cơ gây hại.",
        "Vì sao cần chú ý: muối Cu²⁺ và dung dịch NaOH có tính độc và ăn mòn; việc không tuân thủ quy tắc bảo hộ có thể gây bỏng da, tổn thương mắt hoặc nhiễm độc.",
        "Ý nghĩa học tập: hình thành cho học sinh thói quen làm việc an toàn với hóa chất và nguồn nhiệt, từ đó dễ dàng chuyển từ mô phỏng sang thực nghiệm thật.",
        "Kết quả mong đợi: người học vừa nắm vững kiến thức hóa học, vừa biết tuân thủ các nguyên tắc an toàn cơ bản khi làm thí nghiệm CuSO₄/NaOH/Glucose trong phòng thí nghiệm."
      ]
    }
  ]
}
