{
  "topics": [
    {
      "patterns": [
        "thao tác",
        "cách làm",
        "hướng dẫn",
        "các bước",
        "rót dung dịch",
        "rót cuso4",
        "rót naoh",
        "rót glucose",
        "đun ống d",
        "trộn dung dịch",
        "quan sát hiện tượng"
      ],
      "guide": [
        "Chuẩn bị: Ống A chứa CuSO₄ 0,5 M (20 mL, màu xanh nhạt), ống B chứa NaOH 1,0 M (20 mL, không màu), ống C chứa dung dịch Glucose 0,5 M (10 mL, không màu), ống D rỗng.",
        "Bước 1 – Rót CuSO₄: Nhấn nút \"Rót CuSO₄ → D\" để chuyển dần dung dịch CuSO₄ từ ống A sang ống D. Ống A vơi dần, ống D bắt đầu có màu xanh nhạt của ion Cu²⁺.",
        "Bước 2 – Rót NaOH: Nhấn \"Rót NaOH → D\" để thêm NaOH từ ống B vào ống D. Khi Cu²⁺ gặp OH⁻, kết tủa Cu(OH)₂ màu xanh đậm hình thành, xuất hiện dưới đáy ống D.",
        "Bước 3 – Kiểm tra kết tủa: Sau khi đã có CuSO₄ và NaOH trong ống D, quan sát ống D chuyển màu xanh đậm và xuất hiện các hạt kết tủa xanh – đó là Cu(OH)₂.",
        "Bước 4 – Thêm Glucose: Nhấn \"Rót Glucose → D\" để cho dung dịch Glucose từ ống C vào ống D. Lúc này, trong ống D có Cu(OH)₂ và Glucose trong môi trường kiềm.",
        "Bước 5 – Đun nóng: Nhấn nút \"Đun ống D\". Khi đun, màu xanh đậm của Cu(OH)₂ dần biến đổi, xuất hiện kết tủa Cu₂O màu đỏ gạch dưới đáy ống D.",
        "Sử dụng nút \"Đặt lại\": Nếu muốn làm lại từ đầu, nhấn \"Đặt lại\" để đưa các thể tích và màu sắc ống A, B, C, D về trạng thái ban đầu, xoá kết tủa và mô tả thao tác lại từ đầu."
      ],
      "explain": [
        "Mục đích thí nghiệm: minh hoạ hai bước quan trọng: (1) điều chế Cu(OH)₂ từ CuSO₄ và NaOH trong môi trường kiềm; (2) chứng minh Glucose là chất khử, có thể khử Cu(II) trong Cu(OH)₂ thành Cu(I) dưới dạng Cu₂O màu đỏ gạch khi đun nóng.",
        "Khi rót CuSO₄ vào ống D, ta chỉ mới có ion Cu²⁺ trong dung dịch, màu xanh nhạt. Việc thêm NaOH cung cấp ion OH⁻ để tạo kết tủa Cu(OH)₂: CuSO₄ + 2NaOH → Cu(OH)₂↓ + Na₂SO₄.",
        "Kết tủa Cu(OH)₂ là chất rắn màu xanh đậm, ít tan, được mô phỏng bằng các hạt màu xanh đậm ở đáy ống D. Đây là điều kiện cần để bước sau Glucose có thể khử Cu(II).",
        "Khi thêm Glucose vào ống D (đã có Cu(OH)₂ trong môi trường kiềm), rồi đun nóng, Glucose bị oxi hoá, đồng thời Cu(II) trong Cu(OH)₂ bị khử thành Cu(I) tạo thành Cu₂O kết tủa đỏ gạch: C₆H₁₂O₆ + 2Cu(OH)₂ → C₆H₁₂O₇ + Cu₂O↓ + 2H₂O.",
        "Màu đỏ gạch của Cu₂O là dấu hiệu đặc trưng cho phản ứng của Glucose (một monosaccarit có nhóm –CHO) với Cu(OH)₂ trong môi trường kiềm, tương tự cơ chế của thuốc thử Fehling/Benedict.",
        "Thí nghiệm cho thấy: cần đúng thứ tự và điều kiện (CuSO₄ + NaOH → Cu(OH)₂, rồi mới thêm Glucose và đun) thì mới xuất hiện kết tủa đỏ gạch; nếu thiếu một bước hoặc sai điều kiện, hiện tượng sẽ khác hoặc không rõ."
      ]
    },
    {
      "patterns": [
        "giải thích",
        "bản chất",
        "vì sao",
        "tại sao",
        "mục đích",
        "ý nghĩa",
        "phương trình",
        "cuoh2",
        "cu(oh)2",
        "cu2o",
        "cu2o đỏ gạch",
        "glucose khử",
        "tính khử của glucose"
      ],
      "guide": [
        "Khi muốn giải thích sâu cho học sinh, hãy tách rõ hai giai đoạn: (1) tạo Cu(OH)₂ trong môi trường kiềm; (2) Glucose khử Cu(II) thành Cu(I) khi đun nóng.",
        "Có thể yêu cầu học sinh viết hai phương trình tóm tắt: phản ứng tạo Cu(OH)₂ và phản ứng oxi hoá – khử giữa Glucose và Cu(OH)₂, rồi đối chiếu với mô phỏng.",
        "Nên nhấn mạnh vai trò của môi trường kiềm: NaOH vừa tạo Cu(OH)₂, vừa tạo môi trường thuận lợi để Glucose biểu lộ tính khử.",
        "Khi minh hoạ tính khử của Glucose, có thể liên hệ với thí nghiệm tráng bạc (AgNO₃/NH₃) để học sinh thấy điểm chung: aldehyde/nhóm –CHO bị oxi hoá, còn ion kim loại bị khử."
      ],
      "explain": [
        "Trong bước đầu, CuSO₄ chỉ cung cấp ion Cu²⁺; dung dịch có màu xanh nhạt nhưng chưa phải là dạng thích hợp để Glucose khử. Cần thêm NaOH để tạo thành kết tủa Cu(OH)₂ – đây là dạng Cu(II) hidroxit trong môi trường kiềm.",
        "Phản ứng tạo Cu(OH)₂: CuSO₄ + 2NaOH → Cu(OH)₂↓ + Na₂SO₄. Kết tủa Cu(OH)₂ màu xanh đậm là dấu hiệu cho thấy đã có đủ Cu²⁺ và OH⁻ phản ứng với nhau.",
        "Glucose là một monosaccarit có nhóm chức –CHO (dạng mạch hở), có tính khử. Trong môi trường kiềm và khi đun nóng, Glucose bị oxi hoá (số oxi hoá của C trong nhóm –CHO tăng), đồng thời Cu(II) trong Cu(OH)₂ bị khử thành Cu(I).",
        "Sản phẩm Cu(I) kết tinh dưới dạng Cu₂O – một chất rắn màu đỏ gạch. Đó chính là kết tủa đỏ gạch xuất hiện ở đáy ống D khi mô phỏng đun nóng ống chứa Cu(OH)₂ và Glucose.",
        "Ý nghĩa: thí nghiệm là bằng chứng hoá học cho tính khử của Glucose và các monosaccarit tương tự; đồng thời giúp học sinh nắm vững khái niệm phản ứng oxi hoá – khử: tác chất bị oxi hoá (Glucose) và tác chất bị khử (Cu(II))."
      ]
    },
    {
      "patterns": [
        "lỗi thường gặp",
        "không thấy kết tủa",
        "không thấy màu xanh",
        "không thấy đỏ gạch",
        "không có cu(oh)2",
        "không có cu2o",
        "sai thứ tự",
        "đun không đổi màu",
        "chưa thấy hiện tượng"
      ],
      "guide": [
        "Nếu không thấy kết tủa xanh đậm Cu(OH)₂ trong ống D sau khi trộn, hãy kiểm tra: đã rót cả CuSO₄ và NaOH vào ống D chưa. Chỉ có CuSO₄ hoặc chỉ có NaOH sẽ không tạo được kết tủa.",
        "Nếu bạn rót Glucose vào ống D trước khi tạo Cu(OH)₂ rồi mới đun thì có thể không thấy rõ màu đỏ gạch; hãy đảm bảo trộn CuSO₄ với NaOH để tạo Cu(OH)₂ trước, rồi mới thêm Glucose.",
        "Nếu đun mà không thấy màu đỏ gạch Cu₂O: kiểm tra trong ống D đã có đủ cả Cu(OH)₂ (từ CuSO₄ + NaOH) và Glucose chưa. Thiếu một trong hai thì phản ứng khử Cu(II) → Cu(I) không xảy ra đúng.",
        "Trong mô phỏng, nếu bạn đã đun một lần và muốn quan sát lại từ đầu, hãy nhấn \"Đặt lại\" trước khi rót lại các dung dịch để tránh nhầm lẫn với trạng thái cũ.",
        "Khi muốn so sánh rõ rệt, nên quan sát theo đúng trình tự: (1) màu xanh nhạt CuSO₄; (2) xanh đậm + kết tủa Cu(OH)₂; (3) sau khi thêm Glucose và đun → xuất hiện màu đỏ gạch Cu₂O dưới đáy."
      ],
      "explain": [
        "Việc không thấy Cu(OH)₂ là do chưa đủ điều kiện về mặt hoá học: Cu(OH)₂ chỉ được tạo ra khi có mặt đồng thời ion Cu²⁺ và OH⁻ với tỉ lệ thích hợp. Chỉ có CuSO₄ hoặc chỉ có NaOH thì dung dịch vẫn trong hoặc chỉ hơi đổi màu, không có kết tủa xanh đậm.",
        "Không thấy kết tủa Cu₂O đỏ gạch thường là do thiếu bước: hoặc chưa tạo được Cu(OH)₂, hoặc chưa có Glucose, hoặc không đun đủ thời gian. Phản ứng khử Cu(II) thành Cu(I) cần có cả chất khử (Glucose), chất oxi hoá (Cu(OH)₂) và năng lượng nhiệt.",
        "Thứ tự thao tác ảnh hưởng trực tiếp đến hiện tượng: nếu thêm Glucose khi chưa có Cu(OH)₂ thì Glucose không có \"đối tác\" Cu(II) ở dạng thích hợp để khử, nên khi đun sẽ không cho màu đỏ gạch rõ ràng.",
        "Trong thực tế, nồng độ và tỉ lệ thể tích cũng ảnh hưởng độ rõ của màu và lượng kết tủa. Trong mô phỏng, các giá trị đã được chuẩn hoá để đảm bảo hiện tượng dễ quan sát, nhưng nếu bỏ qua một thao tác (không rót một trong các dung dịch hoặc không nhấn Đun) thì hệ vẫn tuân theo logic hoá học và không cho kết quả đầy đủ."
      ]
    },
    {
      "patterns": [
        "an toàn",
        "lưu ý an toàn",
        "nguy hiểm",
        "bảo hộ",
        "ăn mòn",
        "naoh nguy hiểm",
        "đun nóng",
        "làm thật trong phòng thí nghiệm"
      ],
      "guide": [
        "Trong thí nghiệm thật, NaOH là chất ăn mòn, có thể gây bỏng da và tổn thương mắt. Khi thao tác phải đeo găng tay, kính bảo hộ và áo blouse.",
        "Khi rót dung dịch, nên dùng ống nhỏ giọt hoặc ống đong, không để dung dịch tiếp xúc trực tiếp với da. Nếu bị dính NaOH hoặc dung dịch kiềm lên da, cần rửa ngay dưới vòi nước chảy nhiều phút.",
        "Khi đun ống nghiệm chứa dung dịch Cu(OH)₂ và Glucose, phải dùng kẹp ống nghiệm, hướng miệng ống nghiệm ra xa người và bạn cùng nhóm để tránh bắn nóng.",
        "Không đổ trực tiếp dung dịch thí nghiệm còn nóng vào thùng rác hoặc bồn rửa. Cần để nguội rồi mới xử lý theo hướng dẫn của giáo viên/kỹ thuật viên phòng thí nghiệm.",
        "Thí nghiệm mô phỏng giúp quan sát hiện tượng một cách an toàn; thí nghiệm thật chỉ nên thực hiện trong phòng thí nghiệm với sự giám sát của giáo viên."
      ],
      "explain": [
        "NaOH là bazơ mạnh, có tính ăn mòn cao. Dung dịch NaOH có thể làm hỏng protein của mô sống, gây bỏng hoá học cho da, mắt và niêm mạc, do đó phải sử dụng bảo hộ thích hợp khi thao tác.",
        "Khi đun nóng ống nghiệm, dung dịch có thể sôi cục bộ và bắn ra ngoài; nếu miệng ống nghiệm hướng vào người thì dễ gây bỏng. Đó là lý do quy tắc an toàn luôn yêu cầu hướng miệng ống nghiệm ra xa và không nhìn thẳng vào miệng ống.",
        "Hỗn hợp sau phản ứng chứa cả muối (Na₂SO₄), Cu(II), Cu(I) và Glucose/dẫn xuất của Glucose; không nên tự ý đổ bừa bãi ra môi trường mà cần xử lý theo quy định an toàn hoá chất.",
        "Mô phỏng ảo cho phép học sinh nắm chắc trình tự thao tác, hiện tượng và bản chất phản ứng trước khi tiếp cận thí nghiệm thật, giảm rủi ro sai sót và tai nạn trong phòng thí nghiệm."
      ]
    }
  ]
}
