{
  "topics": [
    {
      "patterns": [
        "tổng quan",
        "mô phỏng gì",
        "bảo toàn động lượng",
        "giới thiệu",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Mô phỏng va chạm 1D giữa hai vật m₁, m₂ trên trục ngang.",
        "Bạn có thể chỉnh: khối lượng m₁, m₂; vận tốc ban đầu v₁, v₂; hệ số đàn hồi e.",
        "Bấm “Bắt đầu” để chạy, “Tạm dừng” để dừng, “Đặt lại” để quay về trạng thái ban đầu.",
        "Đồ thị bên phải hiển thị P_total theo thời gian để kiểm tra tính bảo toàn."
      ],
      "explain": [
        "Mục đích: quan sát định luật bảo toàn động lượng trong va chạm một chiều bằng mô phỏng trực quan.",
        "Vì sao có thí nghiệm này: giúp người học hiểu mối quan hệ giữa khối lượng – vận tốc – động lượng, phân biệt giữa bảo toàn động lượng và năng lượng."
      ]
    },
    {
      "patterns": [
        "thao tác",
        "điều khiển",
        "cách dùng",
        "nút bấm",
        "range",
        "số",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Kéo thanh trượt hoặc nhập số để thay đổi m₁, v₁, m₂, v₂, e.",
        "e = 1: va chạm đàn hồi hoàn toàn; e = 0: dính sau va chạm; 0 < e < 1: đàn hồi không hoàn toàn.",
        "Nút “Bắt đầu” bắt đầu/tiếp tục mô phỏng, “Tạm dừng” dừng, “Đặt lại” đưa các giá trị về ban đầu và xóa đồ thị."
      ],
      "explain": [
        "Mục đích: giúp người học chủ động thay đổi thông số để quan sát tác động của từng đại lượng (m, v, e) đến kết quả va chạm.",
        "Ý nghĩa: tăng tính tương tác và hiểu sâu hơn về các yếu tố ảnh hưởng đến bảo toàn động lượng."
      ]
    },
    {
      "patterns": [
        "động lượng",
        "p=m.v",
        "bảo toàn",
        "p tổng",
        "p1",
        "p2",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Theo dõi số liệu trong khung “Tổng động lượng P” và p₁ = m₁v₁, p₂ = m₂v₂.",
        "Quan sát đồ thị P_total để kiểm tra tính bảo toàn, đặc biệt khi hệ cô lập (không va tường)."
      ],
      "explain": [
        "Mục đích: kiểm chứng định luật bảo toàn động lượng trong hệ cô lập bằng mô phỏng số.",
        "Ý nghĩa: giúp người học nhận biết khi có ngoại lực (va chạm tường), tổng động lượng thay đổi."
      ]
    },
    {
      "patterns": [
        "công thức",
        "sau va chạm",
        "e",
        "đàn hồi",
        "tính v'",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Khi hai vật chạm nhau, vận tốc sau va chạm được tính bằng công thức:",
        "v₁' = ((m₁ − e·m₂)/(m₁ + m₂))·u₁ + (((1 + e)·m₂)/(m₁ + m₂))·u₂",
        "v₂' = (((1 + e)·m₁)/(m₁ + m₂))·u₁ + ((m₂ − e·m₁)/(m₁ + m₂))·u₂"
      ],
      "explain": [
        "Mục đích: giúp người học hiểu vai trò của hệ số đàn hồi e trong việc xác định vận tốc sau va chạm.",
        "Ý nghĩa: liên hệ giữa công thức lý thuyết và hiện tượng mô phỏng, rèn kỹ năng tính toán và suy luận vật lý."
      ]
    },
    {
      "patterns": [
        "tường",
        "biên",
        "cô lập",
        "vì sao P đổi",
        "va vào tường",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Mỗi bên có biên ảo. Khi chạm biên, vật bật ngược (đổi dấu vận tốc) → có lực ngoài tác dụng.",
        "Để kiểm chứng bảo toàn P_total, nên tránh để vật chạm tường trong vùng quan sát hoặc đặt xa biên."
      ],
      "explain": [
        "Mục đích: minh họa sự khác biệt giữa hệ cô lập và hệ có ngoại lực.",
        "Ý nghĩa: giúp người học hiểu điều kiện để định luật bảo toàn động lượng được áp dụng."
      ]
    },
    {
      "patterns": [
        "lỗi",
        "không chạy",
        "bị kẹt",
        "sai số",
        "reset",
        "nhấp nháy",
        "trôi",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "P_total dao động mạnh? → Kiểm tra có va tường không; giảm vận tốc hoặc đặt vật xa biên.",
        "Hai vật ‘chồng’ lên nhau? → Bấm “Đặt lại” hoặc giảm tốc để tránh lỗi chồng hình.",
        "Đồ thị không vẽ? → Hãy bấm “Bắt đầu”; “Tạm dừng” chỉ dừng cập nhật điểm mới."
      ],
      "explain": [
        "Mục đích: giúp người học tự xử lý các lỗi thao tác và hiểu giới hạn của mô phỏng số.",
        "Ý nghĩa: đảm bảo kết quả quan sát ổn định, duy trì tính chính xác của mô phỏng."
      ]
    },
    {
      "patterns": [
        "mẹo",
        "kiểm chứng",
        "bài tập",
        "thí nghiệm số",
        "giải thích",
        "vì sao",
        "mục đích",
        "ý nghĩa"
      ],
      "guide": [
        "Đặt e=1, m₁=m₂, v₂=0 → Sau va chạm, hai vật hoán đổi vận tốc (điển hình va chạm đàn hồi).",
        "Đặt e=0 → Hai vật dính nhau, kiểm tra vận tốc chung v_chung = (m₁u₁ + m₂u₂)/(m₁ + m₂).",
        "Giữ vật tránh tường → Đồ thị P_total nằm ngang (bảo toàn xấp xỉ hoàn toàn)."
      ],
      "explain": [
        "Mục đích: giúp người học tự kiểm chứng các trường hợp đặc biệt của va chạm, củng cố kiến thức.",
        "Ý nghĩa: phát triển tư duy thực nghiệm và khả năng vận dụng định luật bảo toàn động lượng."
      ]
    }
  ]
}
